torvalds/linux/backports/drivers/realtek/8723au/rtl8723AU/core/rtw_bt_mp.c
	return retStatus;
}




u2Byte
mptbt_BtReady(
	PADAPTER		Adapter,
	PBT_REQ_CMD 	pBtReq,
	PBT_RSP_CMD 	pBtRsp
	)
{
	u1Byte				h2cParaBuf[6] ={0};
	u1Byte				h2cParaLen=0;
	u2Byte				paraLen=0;
	u1Byte				retStatus=BT_STATUS_BT_OP_SUCCESS;
	u1Byte				btOpcode;
	u1Byte				btOpcodeVer=0;
	PMPT_CONTEXT		pMptCtx=&(Adapter->mppriv.MptCtx);
	PBT_EXT_C2H			pExtC2h=(PBT_EXT_C2H)&pMptCtx->c2hBuf[0];
	u1Byte				i;
	u1Byte				btFwVer=0, bdAddr[6]={0};
	u2Byte				btRealFwVer=0;
	pu2Byte 			pu2Tmp=NULL;

	//
	// check upper layer parameters
	//

	// 1. check upper layer opcode version
	if(pBtReq->opCodeVer != 1)
	{
		DBG_8192C("[MPT], Error!! Upper OP code version not match!!!\n");
		pBtRsp->status = BT_STATUS_OPCODE_U_VERSION_MISMATCH;
		return paraLen;
	}

	pBtRsp->pParamStart[0] = MP_BT_NOT_READY;
	paraLen = 10;
	//
	// execute lower layer opcodes
	//

	// Get BT FW version
	// fill h2c parameters
	btOpcode = BT_LO_OP_GET_BT_VERSION;
	// execute h2c and check respond c2h from bt fw is correct or not
	retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);
	// ckeck bt return status.
	if(BT_STATUS_BT_OP_SUCCESS != retStatus)
	{
		pBtRsp->status = ((btOpcode<<8)|retStatus);
		DBG_8192C("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
		return paraLen;
	}
	else
	{
		pu2Tmp = (pu2Byte)&pExtC2h->buf[0];
		btRealFwVer = *pu2Tmp;
		btFwVer = pExtC2h->buf[1];
		DBG_8192C("[MPT], btRealFwVer=0x%x, btFwVer=0x%x\n", btRealFwVer, btFwVer);
	}

	// Get BD Address
	// fill h2c parameters
	btOpcode = BT_LO_OP_GET_BD_ADDR_L;
	// execute h2c and check respond c2h from bt fw is correct or not
	retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);
	// ckeck bt return status.
	if(BT_STATUS_BT_OP_SUCCESS != retStatus)
	{
		pBtRsp->status = ((btOpcode<<8)|retStatus);
		DBG_8192C("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
		return paraLen;
	}
	else
	{
		bdAddr[5] = pExtC2h->buf[0];
		bdAddr[4] = pExtC2h->buf[1];
		bdAddr[3] = pExtC2h->buf[2];
	}

	// fill h2c parameters
	btOpcode = BT_LO_OP_GET_BD_ADDR_H;
	// execute h2c and check respond c2h from bt fw is correct or not
	retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);
	// ckeck bt return status.
	if(BT_STATUS_BT_OP_SUCCESS != retStatus)
	{
		pBtRsp->status = ((btOpcode<<8)|retStatus);
		DBG_8192C("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
		return paraLen;
	}
	else
	{
		bdAddr[2] = pExtC2h->buf[0];
		bdAddr[1] = pExtC2h->buf[1];
		bdAddr[0] = pExtC2h->buf[2];
	}
	DBG_8192C("[MPT], Local BDAddr:");
	for(i=0; i<6; i++)
	{
		DBG_8192C(" 0x%x ", bdAddr[i]);
	}
	pBtRsp->status = BT_STATUS_SUCCESS;
	pBtRsp->pParamStart[0] = MP_BT_READY;
	pu2Tmp = (pu2Byte)&pBtRsp->pParamStart[1];
	*pu2Tmp = btRealFwVer;
	pBtRsp->pParamStart[3] = btFwVer;
	for(i=0; i<6; i++)
	{
		pBtRsp->pParamStart[4+i] = bdAddr[5-i];
	}

	return paraLen;
}

void mptbt_close_WiFiRF(PADAPTER Adapter)
{
	PHY_SetBBReg(Adapter, 0x824, 0xF, 0x0);
	PHY_SetBBReg(Adapter, 0x824, 0x700000, 0x0);
	PHY_SetRFReg(Adapter, RF90_PATH_A, 0x0, 0xF0000, 0x0);
}

void mptbt_open_WiFiRF(PADAPTER	Adapter)
{
	PHY_SetBBReg(Adapter, 0x824, 0x700000, 0x3);
	PHY_SetBBReg(Adapter, 0x824, 0xF, 0x2);
	PHY_SetRFReg(Adapter, RF90_PATH_A, 0x0, 0xF0000, 0x3);
}

u4Byte mptbt_switch_RF(PADAPTER	Adapter, u1Byte	Enter)
{
	u2Byte	tmp_2byte = 0;

	//Enter test mode
	if (Enter) {
		////1>. close WiFi RF
		mptbt_close_WiFiRF(Adapter);
		
		////2>. change ant switch to BT
		tmp_2byte = rtw_read16(Adapter, 0x860);
		tmp_2byte = tmp_2byte | BIT(9);
		tmp_2byte = tmp_2byte & (~BIT(8));
		rtw_write16(Adapter, 0x860, tmp_2byte);
		rtw_write16(Adapter, 0x870, 0x300);
	} else {
		////1>. Open WiFi RF
		mptbt_open_WiFiRF(Adapter);
		
		////2>. change ant switch back
		tmp_2byte = rtw_read16(Adapter, 0x860);
		tmp_2byte = tmp_2byte | BIT(8);
		tmp_2byte = tmp_2byte & (~BIT(9));
		rtw_write16(Adapter, 0x860, tmp_2byte);
		rtw_write16(Adapter, 0x870, 0x300);
	}

	return 0;
}

u2Byte
mptbt_BtSetMode(
	PADAPTER		Adapter,
	PBT_REQ_CMD 	pBtReq,
	PBT_RSP_CMD 	pBtRsp
	)
{
	u1Byte				h2cParaBuf[6] ={0};
	u1Byte				h2cParaLen=0;
	u2Byte				paraLen=0;
	u1Byte				retStatus=BT_STATUS_BT_OP_SUCCESS;
	u1Byte				btOpcode;
	u1Byte				btOpcodeVer=0;
	u1Byte				btModeToSet=0;

	//
	// check upper layer parameters
	//
	// 1. check upper layer opcode version
	if(pBtReq->opCodeVer != 1)
	{
		DBG_8192C("[MPT], Error!! Upper OP code version not match!!!\n");
		pBtRsp->status = BT_STATUS_OPCODE_U_VERSION_MISMATCH;
		return paraLen;
	}
	// 2. check upper layer parameter length
	if(1 == pBtReq->paraLength)
	{
		btModeToSet = pBtReq->pParamStart[0];
		DBG_8192C("[MPT], BtTestMode=%d \n", btModeToSet);
	}
	else
	{
		DBG_8192C("[MPT], Error!! wrong parameter length=%d (should be 1)\n", pBtReq->paraLength);
		pBtRsp->status = BT_STATUS_PARAMETER_FORMAT_ERROR_U;
		return paraLen;
	}
	
	//
	// execute lower layer opcodes
	//
	
	// 1. fill h2c parameters	
	// check bt mode
	btOpcode = BT_LO_OP_SET_BT_MODE;
	if(btModeToSet >= MP_BT_MODE_MAX)
	{
		pBtRsp->status = BT_STATUS_PARAMETER_OUT_OF_RANGE_U;
		return paraLen;
	}
	else
	{
		mptbt_switch_RF(Adapter, 1);

		h2cParaBuf[0] = btModeToSet;
		h2cParaLen = 1;
		// 2. execute h2c and check respond c2h from bt fw is correct or not
		retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);
	}
	
	// 3. construct respond status code and data.
	if(BT_STATUS_BT_OP_SUCCESS == retStatus)
	{
		pBtRsp->status = BT_STATUS_SUCCESS;
	}
	else
	{
		pBtRsp->status = ((btOpcode<<8)|retStatus);
		DBG_8192C("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
	}
	
	return paraLen;
}


VOID
MPTBT_FwC2hBtMpCtrl(
	PADAPTER	Adapter,
	pu1Byte 	tmpBuf,
	u1Byte		length
	)
{
	u32 i;
	PMPT_CONTEXT	pMptCtx=&(Adapter->mppriv.MptCtx);
	PBT_EXT_C2H pExtC2h=(PBT_EXT_C2H)tmpBuf;
	
	if(Adapter->bBTFWReady == _FALSE || Adapter->registrypriv.mp_mode == 0 )
	{	
		DBG_8192C("[MPT], %s,bBTFWReady == _FALSE\n",__func__);
		return;
	}
	//cancel_timeout for h2c handle
	_cancel_timer_ex( &pMptCtx->MPh2c_timeout_timer);

