torvalds/linux/backports/drivers/realtek/8723au/rtl8723AU/core/rtw_bt_mp.c
	// check parameter first
	switch(setType)
	{
		case BT_GSET_REG:
			DBG_8192C ("[MPT], [BT_GSET_REG]\n");
			validParaLen = 9;
			if(setParaLen == validParaLen)
			{
				btOpcode = BT_LO_OP_WRITE_REG_VALUE;
				regType = pBtReq->pParamStart[1];
				pu4Tmp = (pu4Byte)&pBtReq->pParamStart[2];
				regAddr = *pu4Tmp;
				pu4Tmp = (pu4Byte)&pBtReq->pParamStart[6];
				regValue = *pu4Tmp;
				DBG_8192C("[MPT], BT_GSET_REG regType=0x%x, regAddr=0x%x, regValue=0x%x!!\n", 
					regType, regAddr, regValue);
				if(regType >= BT_REG_MAX)
				{
					pBtRsp->status = (btOpcode<<8)| BT_STATUS_PARAMETER_OUT_OF_RANGE_U;
					return paraLen;
				}
				else
				{
					if( ((BT_REG_RF==regType)&&(regAddr>0x7f)) ||
						((BT_REG_MODEM==regType)&&(regAddr>0x1ff)) ||
						((BT_REG_BLUEWIZE==regType)&&(regAddr>0xfff)) ||
						((BT_REG_VENDOR==regType)&&(regAddr>0xfff)) ||
						((BT_REG_LE==regType)&&(regAddr>0xfff)) )
					{				
						pBtRsp->status = (btOpcode<<8)| BT_STATUS_PARAMETER_OUT_OF_RANGE_U;
						return paraLen;
					}
				}
			}
			break;
		case BT_GSET_RESET:
			DBG_8192C("[MPT], [BT_GSET_RESET]\n");
			validParaLen = 0;
			break;
		case BT_GSET_TARGET_BD_ADDR:
			DBG_8192C("[MPT], [BT_GSET_TARGET_BD_ADDR]\n");
			validParaLen = 6;
			if(setParaLen == validParaLen)
			{
				btOpcode = BT_LO_OP_SET_TARGET_BD_ADDR_H;
				if( (pBtReq->pParamStart[1]==0) &&
					(pBtReq->pParamStart[2]==0) &&
					(pBtReq->pParamStart[3]==0) &&
					(pBtReq->pParamStart[4]==0) &&
					(pBtReq->pParamStart[5]==0) &&
					(pBtReq->pParamStart[6]==0) )
				{
					DBG_8192C("[MPT], Error!! targetBDAddr=all zero\n");
					pBtRsp->status = (btOpcode<<8)|BT_STATUS_PARAMETER_OUT_OF_RANGE_U;
					return paraLen;
				}
				if( (pBtReq->pParamStart[1]==0xff) &&
					(pBtReq->pParamStart[2]==0xff) &&
					(pBtReq->pParamStart[3]==0xff) &&
					(pBtReq->pParamStart[4]==0xff) &&
					(pBtReq->pParamStart[5]==0xff) &&
					(pBtReq->pParamStart[6]==0xff) )
				{
					DBG_8192C("[MPT], Error!! targetBDAddr=all 0xf\n");
					pBtRsp->status = (btOpcode<<8)|BT_STATUS_PARAMETER_OUT_OF_RANGE_U;
					return paraLen;
				}
				bdAddr[0] = pBtReq->pParamStart[6];
				bdAddr[1] = pBtReq->pParamStart[5];
				bdAddr[2] = pBtReq->pParamStart[4];
				bdAddr[3] = pBtReq->pParamStart[3];
				bdAddr[4] = pBtReq->pParamStart[2];
				bdAddr[5] = pBtReq->pParamStart[1];
				DBG_8192C ("[MPT], target BDAddr:%x,%x,%x,%x,%x,%x\n", 
							bdAddr[0],bdAddr[1],bdAddr[2],bdAddr[3],bdAddr[4],bdAddr[5]);
			}
			break;
		case BT_GSET_TX_PWR_FINETUNE:
			DBG_8192C("[MPT], [BT_GSET_TX_PWR_FINETUNE]\n");
			validParaLen = 1;
			if(setParaLen == validParaLen)
			{
				btOpcode = BT_LO_OP_SET_TX_POWER_CALIBRATION;
				calVal = pBtReq->pParamStart[1];
				if( (calVal<1) || (calVal>9) )
				{
					pBtRsp->status = (btOpcode<<8)|BT_STATUS_PARAMETER_OUT_OF_RANGE_U;
					return paraLen;
				}
				DBG_8192C ("[MPT], calVal=%d\n", calVal);
			}
			break;
		case BT_SET_TRACKING_INTERVAL:
			DBG_871X("[MPT], [BT_SET_TRACKING_INTERVAL] setParaLen =%d \n",setParaLen);
			
			validParaLen = 1;	
			if(setParaLen == validParaLen)	
				calVal = pBtReq->pParamStart[1];
			break;
		case BT_SET_THERMAL_METER:
			DBG_871X("[MPT], [BT_SET_THERMAL_METER] setParaLen =%d \n",setParaLen);
			validParaLen = 1;	
			if(setParaLen == validParaLen)	
				calVal = pBtReq->pParamStart[1];
			break;
		case BT_ENABLE_CFO_TRACKING:
			DBG_871X("[MPT], [BT_ENABLE_CFO_TRACKING] setParaLen =%d \n",setParaLen);
			validParaLen = 1;	
			if(setParaLen == validParaLen)	
				calVal = pBtReq->pParamStart[1];
			break;
		case BT_GSET_UPDATE_BT_PATCH:
			if(IS_HARDWARE_TYPE_8723AE(Adapter) && Adapter->bFWReady)
			{
				u1Byte i;
				DBG_8192C ("[MPT], write regs for load patch\n");
				//BTFwPatch8723A(Adapter);
				PlatformEFIOWrite1Byte(Adapter, 0xCC, 0x2d);
				rtw_msleep_os(50);
				PlatformEFIOWrite4Byte(Adapter, 0x68, 0xa005000c);
				rtw_msleep_os(50);
				PlatformEFIOWrite4Byte(Adapter, 0x68, 0xb005000c);
				rtw_msleep_os(50);
				PlatformEFIOWrite1Byte(Adapter, 0xCC, 0x29);
				for(i=0; i<12; i++)
				rtw_msleep_os(100);
//#if (DEV_BUS_TYPE == RT_PCI_INTERFACE)
//				BTFwPatch8723A(Adapter);
//#endif
				DBG_8192C("[MPT], load BT FW Patch finished!!!\n");
			}
			break;
		default:
			{
				DBG_8192C ("[MPT], Error!! setType=%d, out of range\n", setType);
				pBtRsp->status = BT_STATUS_PARAMETER_OUT_OF_RANGE_U;
				return paraLen;
			}
			break;
	}
	if(setParaLen != validParaLen)
	{
		DBG_8192C("[MPT], Error!! wrong parameter length=%d for BT_SET_GEN_CMD cmd id=0x%x, paraLen should=0x%x\n",
			setParaLen, setType, validParaLen);
		pBtRsp->status = BT_STATUS_PARAMETER_FORMAT_ERROR_U;
		return paraLen;
	}
	
	//
	// execute lower layer opcodes
	//
	if(BT_GSET_REG == setType)
	{
		// fill h2c parameters
		// here we should write reg value first then write the address, adviced by Austin
		btOpcode = BT_LO_OP_WRITE_REG_VALUE;
		h2cParaBuf[0] = pBtReq->pParamStart[6];
		h2cParaBuf[1] = pBtReq->pParamStart[7];
		h2cParaBuf[2] = pBtReq->pParamStart[8];
		h2cParaLen = 3;
		// execute h2c and check respond c2h from bt fw is correct or not
		retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);
		// construct respond status code and data.
		if(BT_STATUS_BT_OP_SUCCESS != retStatus)
		{
			pBtRsp->status = ((btOpcode<<8)|retStatus);
			DBG_8192C("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
			return paraLen;
		}
		
		// write reg address
		btOpcode = BT_LO_OP_WRITE_REG_ADDR;
		h2cParaBuf[0] = regType;
		h2cParaBuf[1] = pBtReq->pParamStart[2];
		h2cParaBuf[2] = pBtReq->pParamStart[3];
		h2cParaLen = 3;
		// execute h2c and check respond c2h from bt fw is correct or not
		retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);
		// construct respond status code and data.
		if(BT_STATUS_BT_OP_SUCCESS != retStatus)
		{
			pBtRsp->status = ((btOpcode<<8)|retStatus);
			DBG_8192C("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
			return paraLen;
		}		
	}
	else if(BT_GSET_RESET == setType)
	{
		btOpcode = BT_LO_OP_RESET;
		h2cParaLen = 0;
		// execute h2c and check respond c2h from bt fw is correct or not
		retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);
		// construct respond status code and data.
		if(BT_STATUS_BT_OP_SUCCESS != retStatus)
		{
			pBtRsp->status = ((btOpcode<<8)|retStatus);
			DBG_8192C("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
			return paraLen;
		}
	}
	else if(BT_GSET_TARGET_BD_ADDR == setType)
	{
		// fill h2c parameters
		btOpcode = BT_LO_OP_SET_TARGET_BD_ADDR_L;
		h2cParaBuf[0] = pBtReq->pParamStart[1];
		h2cParaBuf[1] = pBtReq->pParamStart[2];
		h2cParaBuf[2] = pBtReq->pParamStart[3];
		h2cParaLen = 3;
		retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);		
		// ckeck bt return status.
		if(BT_STATUS_BT_OP_SUCCESS != retStatus)
		{
			pBtRsp->status = ((btOpcode<<8)|retStatus);
			DBG_8192C ("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
			return paraLen;
		}

		btOpcode = BT_LO_OP_SET_TARGET_BD_ADDR_H;
		h2cParaBuf[0] = pBtReq->pParamStart[4];
		h2cParaBuf[1] = pBtReq->pParamStart[5];
		h2cParaBuf[2] = pBtReq->pParamStart[6];
		h2cParaLen = 3;
		retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);		
		// ckeck bt return status.
		if(BT_STATUS_BT_OP_SUCCESS != retStatus)
		{
			pBtRsp->status = ((btOpcode<<8)|retStatus);
			DBG_8192C ("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
			return paraLen;
		}
	}
	else if(BT_GSET_TX_PWR_FINETUNE == setType)
	{
		// fill h2c parameters
		btOpcode = BT_LO_OP_SET_TX_POWER_CALIBRATION;
		h2cParaBuf[0] = calVal;
		h2cParaLen = 1;
		retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);
		// ckeck bt return status.
		if(BT_STATUS_BT_OP_SUCCESS != retStatus)
		{
			pBtRsp->status = ((btOpcode<<8)|retStatus);
			DBG_8192C("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
			return paraLen;
		}
	}
	else if(BT_SET_TRACKING_INTERVAL == setType)
	{
		//	BT_LO_OP_SET_TRACKING_INTERVAL								= 0x22,
		//	BT_LO_OP_SET_THERMAL_METER									= 0x23,
		//	BT_LO_OP_ENABLE_CFO_TRACKING									= 0x24,
				btOpcode = BT_LO_OP_SET_TRACKING_INTERVAL;
				h2cParaBuf[0] = calVal;
				h2cParaLen = 1;
				retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);		
				// ckeck bt return status.
				if(BT_STATUS_BT_OP_SUCCESS != retStatus)
				{
					pBtRsp->status = ((btOpcode<<8)|retStatus);
					DBG_8192C ("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
					return paraLen;
				}
	}
	else if(BT_SET_THERMAL_METER == setType)
	{
				btOpcode = BT_LO_OP_SET_THERMAL_METER;
				h2cParaBuf[0] = calVal;
				h2cParaLen = 1;
				retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);		
				// ckeck bt return status.
				if(BT_STATUS_BT_OP_SUCCESS != retStatus)
				{
					pBtRsp->status = ((btOpcode<<8)|retStatus);
					DBG_8192C ("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
					return paraLen;
				}
	}
	else if(BT_ENABLE_CFO_TRACKING == setType)
	{
				btOpcode = BT_LO_OP_ENABLE_CFO_TRACKING;
				h2cParaBuf[0] = calVal;
				h2cParaLen = 1;
				retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);		
				// ckeck bt return status.
				if(BT_STATUS_BT_OP_SUCCESS != retStatus)
				{
					pBtRsp->status = ((btOpcode<<8)|retStatus);
					DBG_8192C ("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
			return paraLen;
		}
	}
	
	pBtRsp->status = BT_STATUS_SUCCESS;
	return paraLen;
}



u2Byte
mptbt_BtSetTxRxPars(
	IN	PADAPTER		Adapter,
	IN	PBT_REQ_CMD 	pBtReq,
	IN	PBT_RSP_CMD 	pBtRsp
	)
{
	u1Byte				h2cParaBuf[6] ={0};
	u1Byte				h2cParaLen=0;
	u2Byte				paraLen=0;
	u1Byte				retStatus=BT_STATUS_BT_OP_SUCCESS;
	u1Byte				btOpcode;
	u1Byte				btOpcodeVer=0;
	PBT_TXRX_PARAMETERS pTxRxPars=(PBT_TXRX_PARAMETERS)&pBtReq->pParamStart[0];
	u2Byte				lenTxRx=sizeof(BT_TXRX_PARAMETERS);
	u1Byte				i;
	u1Byte				bdAddr[6]={0};

	//
	// check upper layer parameters
	//
	
	// 1. check upper layer opcode version
	if(pBtReq->opCodeVer != 1)
	{
		DBG_8192C("[MPT], Error!! Upper OP code version not match!!!\n");
		pBtRsp->status = BT_STATUS_OPCODE_U_VERSION_MISMATCH;
		return paraLen;
	}
	// 2. check upper layer parameter length
	if(pBtReq->paraLength == sizeof(BT_TXRX_PARAMETERS))
	{	
		DBG_8192C ("[MPT], pTxRxPars->txrxChannel=0x%x \n", pTxRxPars->txrxChannel);
		DBG_8192C ("[MPT], pTxRxPars->txrxTxPktCnt=0x%8x \n", pTxRxPars->txrxTxPktCnt);
		DBG_8192C  ("[MPT], pTxRxPars->txrxTxPktInterval=0x%x \n", pTxRxPars->txrxTxPktInterval);
		DBG_8192C  ("[MPT], pTxRxPars->txrxPayloadType=0x%x \n", pTxRxPars->txrxPayloadType);
		DBG_8192C  ("[MPT], pTxRxPars->txrxPktType=0x%x \n", pTxRxPars->txrxPktType);
		DBG_8192C  ("[MPT], pTxRxPars->txrxPayloadLen=0x%x \n", pTxRxPars->txrxPayloadLen);
		DBG_8192C  ("[MPT], pTxRxPars->txrxPktHeader=0x%x \n", pTxRxPars->txrxPktHeader);
		DBG_8192C  ("[MPT], pTxRxPars->txrxWhitenCoeff=0x%x \n", pTxRxPars->txrxWhitenCoeff); 	
		bdAddr[0] = pTxRxPars->txrxBdaddr[5];
		bdAddr[1] = pTxRxPars->txrxBdaddr[4];
		bdAddr[2] = pTxRxPars->txrxBdaddr[3];
		bdAddr[3] = pTxRxPars->txrxBdaddr[2];
		bdAddr[4] = pTxRxPars->txrxBdaddr[1];
		bdAddr[5] = pTxRxPars->txrxBdaddr[0];
		DBG_8192C  ("[MPT], pTxRxPars->txrxBdaddr: %s", &bdAddr[0]);
		DBG_8192C ("[MPT], pTxRxPars->txrxTxGainIndex=0x%x \n", pTxRxPars->txrxTxGainIndex);
	}
	else
	{
		DBG_8192C  ("[MPT], Error!! pBtReq->paraLength=%d, correct Len=%d\n", pBtReq->paraLength, lenTxRx);
		pBtRsp->status = BT_STATUS_PARAMETER_FORMAT_ERROR_U;
		return paraLen;
	}

	//
	// execute lower layer opcodes
	//
	
	// fill h2c parameters
	btOpcode = BT_LO_OP_SET_PKT_HEADER;
	if(pTxRxPars->txrxPktHeader > 0x3ffff)
	{
		DBG_8192C  ("[MPT], Error!! pTxRxPars->txrxPktHeader=0x%x is out of range, (should be between 0x0~0x3ffff)\n", pTxRxPars->txrxPktHeader);
		pBtRsp->status = (btOpcode<<8)|BT_STATUS_PARAMETER_OUT_OF_RANGE_U;
		return paraLen;
	}
	else
	{
		h2cParaBuf[0] = (u1Byte)(pTxRxPars->txrxPktHeader&0xff);
		h2cParaBuf[1] = (u1Byte)((pTxRxPars->txrxPktHeader&0xff00)>>8);
		h2cParaBuf[2] = (u1Byte)((pTxRxPars->txrxPktHeader&0xff0000)>>16);
		h2cParaLen = 3;
		retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);
	}
	
	// ckeck bt return status.
	if(BT_STATUS_BT_OP_SUCCESS != retStatus)
	{
		pBtRsp->status = ((btOpcode<<8)|retStatus);
		DBG_8192C  ("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
		return paraLen;
	}	

	// fill h2c parameters
	btOpcode = BT_LO_OP_SET_PKT_TYPE_LEN;
	{
		u2Byte	payloadLenLimit=0;
		switch(pTxRxPars->txrxPktType)
		{
			case MP_BT_PKT_DH1:
				payloadLenLimit = 27*8;
				break;
			case MP_BT_PKT_DH3:
				payloadLenLimit = 183*8;
				break;
			case MP_BT_PKT_DH5:
				payloadLenLimit = 339*8;
				break;
			case MP_BT_PKT_2DH1:
				payloadLenLimit = 54*8;
				break;
			case MP_BT_PKT_2DH3:
				payloadLenLimit = 367*8;
				break;
			case MP_BT_PKT_2DH5:
				payloadLenLimit = 679*8;
				break;
			case MP_BT_PKT_3DH1:
				payloadLenLimit = 83*8;
				break;
			case MP_BT_PKT_3DH3:
				payloadLenLimit = 552*8;
				break;
			case MP_BT_PKT_3DH5:
				payloadLenLimit = 1021*8;
				break;
			case MP_BT_PKT_LE:
				payloadLenLimit = 39*8;
				break;
			default:
				{
					DBG_8192C  ("[MPT], Error!! Unknown pTxRxPars->txrxPktType=0x%x\n", pTxRxPars->txrxPktType);
					pBtRsp->status = (btOpcode<<8)|BT_STATUS_PARAMETER_OUT_OF_RANGE_U;
					return paraLen;
				}
				break;
		}

		if(pTxRxPars->txrxPayloadLen > payloadLenLimit)
		{
			DBG_8192C ("[MPT], Error!! pTxRxPars->txrxPayloadLen=0x%x, (should smaller than %d)\n", 
				pTxRxPars->txrxPayloadLen, payloadLenLimit);
			pBtRsp->status = (btOpcode<<8)|BT_STATUS_PARAMETER_OUT_OF_RANGE_U;
			return paraLen;
		}

		h2cParaBuf[0] = pTxRxPars->txrxPktType;
		h2cParaBuf[1] = (u1Byte)((pTxRxPars->txrxPayloadLen&0xff));
		h2cParaBuf[2] = (u1Byte)((pTxRxPars->txrxPayloadLen&0xff00)>>8);
		h2cParaLen = 3;
		retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);
	}

	// ckeck bt return status.
	if(BT_STATUS_BT_OP_SUCCESS != retStatus)
	{
		pBtRsp->status = ((btOpcode<<8)|retStatus);
		DBG_8192C ("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
		return paraLen;
	}

	// fill h2c parameters
	btOpcode = BT_LO_OP_SET_PKT_CNT_L_PL_TYPE;
	if(pTxRxPars->txrxPayloadType > MP_BT_PAYLOAD_MAX)
	{
		DBG_8192C  ("[MPT], Error!! pTxRxPars->txrxPayloadType=0x%x, (should be between 0~4)\n", pTxRxPars->txrxPayloadType);
		pBtRsp->status = (btOpcode<<8)|BT_STATUS_PARAMETER_OUT_OF_RANGE_U;
		return paraLen;
	}
	else
	{
		h2cParaBuf[0] = (u1Byte)((pTxRxPars->txrxTxPktCnt&0xff));
		h2cParaBuf[1] = (u1Byte)((pTxRxPars->txrxTxPktCnt&0xff00)>>8);
		h2cParaBuf[2] = pTxRxPars->txrxPayloadType;
		h2cParaLen = 3;
		retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);
	}
	
	// ckeck bt return status.
	if(BT_STATUS_BT_OP_SUCCESS != retStatus)
	{
		pBtRsp->status = ((btOpcode<<8)|retStatus);
		DBG_8192C ("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
		return paraLen;
	}	

	// fill h2c parameters
	btOpcode = BT_LO_OP_SET_PKT_CNT_H_PKT_INTV;
	if(pTxRxPars->txrxTxPktInterval > 15)
	{
	DBG_8192C  ("[MPT], Error!! pTxRxPars->txrxTxPktInterval=0x%x, (should be between 0~15)\n", pTxRxPars->txrxTxPktInterval);
	pBtRsp->status = (btOpcode<<8)|BT_STATUS_PARAMETER_OUT_OF_RANGE_U;
		return paraLen;
	}
	else
	{
		h2cParaBuf[0] = (u1Byte)((pTxRxPars->txrxTxPktCnt&0xff0000)>>16);
		h2cParaBuf[1] = (u1Byte)((pTxRxPars->txrxTxPktCnt&0xff000000)>>24);
		h2cParaBuf[2] = pTxRxPars->txrxTxPktInterval;
		h2cParaLen = 3;
		retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);
	}
	
	// ckeck bt return status.
	if(BT_STATUS_BT_OP_SUCCESS != retStatus)
	{
		pBtRsp->status = ((btOpcode<<8)|retStatus);
		DBG_8192C ("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
		return paraLen;
	}	

	// fill h2c parameters
	btOpcode = BT_LO_OP_SET_WHITENCOEFF;
	{
		h2cParaBuf[0] = pTxRxPars->txrxWhitenCoeff;
		h2cParaLen = 1;
		retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);
	}
	
	// ckeck bt return status.
	if(BT_STATUS_BT_OP_SUCCESS != retStatus)
	{
		pBtRsp->status = ((btOpcode<<8)|retStatus);
		DBG_8192C  ("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
		return paraLen;
	}


	// fill h2c parameters
	btOpcode = BT_LO_OP_SET_CHNL_TX_GAIN;
	if( (pTxRxPars->txrxChannel > 78) ||
		(pTxRxPars->txrxTxGainIndex > 7) )
	{
		DBG_8192C ("[MPT], Error!! pTxRxPars->txrxChannel=0x%x, (should be between 0~78)\n", pTxRxPars->txrxChannel);
		DBG_8192C ("[MPT], Error!! pTxRxPars->txrxTxGainIndex=0x%x, (should be between 0~7)\n", pTxRxPars->txrxTxGainIndex);
		pBtRsp->status = (btOpcode<<8)|BT_STATUS_PARAMETER_OUT_OF_RANGE_U;
		return paraLen;
	}
	else
	{
		h2cParaBuf[0] = pTxRxPars->txrxChannel;
		h2cParaBuf[1] = pTxRxPars->txrxTxGainIndex;
		h2cParaLen = 2;
		retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);
	}
	
	// ckeck bt return status.
	if(BT_STATUS_BT_OP_SUCCESS != retStatus)
	{
		pBtRsp->status = ((btOpcode<<8)|retStatus);
		DBG_8192C ("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
		return paraLen;
	}

	// fill h2c parameters
	btOpcode = BT_LO_OP_SET_BD_ADDR_L;
	if( (pTxRxPars->txrxBdaddr[0]==0) &&
		(pTxRxPars->txrxBdaddr[1]==0) &&
		(pTxRxPars->txrxBdaddr[2]==0) &&
		(pTxRxPars->txrxBdaddr[3]==0) &&
		(pTxRxPars->txrxBdaddr[4]==0) &&
		(pTxRxPars->txrxBdaddr[5]==0) )
	{
		DBG_8192C ("[MPT], Error!! pTxRxPars->txrxBdaddr=all zero\n");
		pBtRsp->status = (btOpcode<<8)|BT_STATUS_PARAMETER_OUT_OF_RANGE_U;
		return paraLen;
	}
	if( (pTxRxPars->txrxBdaddr[0]==0xff) &&
		(pTxRxPars->txrxBdaddr[1]==0xff) &&
		(pTxRxPars->txrxBdaddr[2]==0xff) &&
		(pTxRxPars->txrxBdaddr[3]==0xff) &&
		(pTxRxPars->txrxBdaddr[4]==0xff) &&
		(pTxRxPars->txrxBdaddr[5]==0xff) )
	{
		DBG_8192C ("[MPT], Error!! pTxRxPars->txrxBdaddr=all 0xf\n");
		pBtRsp->status = (btOpcode<<8)|BT_STATUS_PARAMETER_OUT_OF_RANGE_U;
		return paraLen;
	}
	
	{
		h2cParaBuf[0] = pTxRxPars->txrxBdaddr[0];
		h2cParaBuf[1] = pTxRxPars->txrxBdaddr[1];
		h2cParaBuf[2] = pTxRxPars->txrxBdaddr[2];
		h2cParaLen = 3;
		retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);
	}
	// ckeck bt return status.
	if(BT_STATUS_BT_OP_SUCCESS != retStatus)
	{
		pBtRsp->status = ((btOpcode<<8)|retStatus);
		DBG_8192C ("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
		return paraLen;
	}	

